public class Main {
    public static void main(String[] args) {
        int price = 50_000;
        int rubles_mile = 20;
        int bonus_mile = price / rubles_mile;
        System.out.println("Количество начисленных миль за купленный билет: " + bonus_mile);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}